; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
(at ball39 room6)
(at ball40 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room6)
(at ball2 room6)
(at ball3 room6)
(at ball4 room6)
(at ball5 room6)
(at ball6 room6)
(at ball7 room6)
(at ball8 room6)
(at ball9 room6)
(at ball10 room6)
(at ball11 room6)
(at ball12 room6)
(at ball13 room6)
(at ball14 room6)
(at ball15 room6)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at ball20 room6)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
(at ball25 room6)
(at ball26 room6)
(at ball27 room6)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
(at ball39 room6)
(at ball40 room6)
)
)
)

; plan
1. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 5 of 40
2. (pick ball7 rooma right)
   deleted: (at ball7 rooma) (free right)
   added: (carry ball7 right)
   goals met: 5 of 40
3. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 5 of 40
4. (drop ball7 room6 right)
   deleted: (carry ball7 right)
   added: (at ball7 room6) (free right)
   goals met: 6 of 40
5. (drop ball8 room6 left)
   deleted: (carry ball8 left)
   added: (at ball8 room6) (free left)
   goals met: 7 of 40
6. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 7 of 40
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 7 of 40
8. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 7 of 40
9. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 7 of 40
10. (drop ball11 room6 right)
   deleted: (carry ball11 right)
   added: (at ball11 room6) (free right)
   goals met: 8 of 40
11. (drop ball9 room6 left)
   deleted: (carry ball9 left)
   added: (at ball9 room6) (free left)
   goals met: 9 of 40
12. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 9 of 40
13. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 9 of 40
14. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 9 of 40
15. (drop ball10 room6 left)
   deleted: (carry ball10 left)
   added: (at ball10 room6) (free left)
   goals met: 10 of 40
16. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 10 of 40
17. (pick ball35 room5 left)
   deleted: (at ball35 room5) (free left)
   added: (carry ball35 left)
   goals met: 10 of 40
18. (pick ball34 room5 right)
   deleted: (at ball34 room5) (free right)
   added: (carry ball34 right)
   goals met: 10 of 40
19. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 10 of 40
20. (drop ball34 room6 right)
   deleted: (carry ball34 right)
   added: (at ball34 room6) (free right)
   goals met: 11 of 40
21. (drop ball35 room6 left)
   deleted: (carry ball35 left)
   added: (at ball35 room6) (free left)
   goals met: 12 of 40
22. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 12 of 40
23. (pick ball33 room5 left)
   deleted: (at ball33 room5) (free left)
   added: (carry ball33 left)
   goals met: 12 of 40
24. (pick ball32 room5 right)
   deleted: (at ball32 room5) (free right)
   added: (carry ball32 right)
   goals met: 12 of 40
25. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 12 of 40
26. (drop ball32 room6 right)
   deleted: (carry ball32 right)
   added: (at ball32 room6) (free right)
   goals met: 13 of 40
27. (drop ball33 room6 left)
   deleted: (carry ball33 left)
   added: (at ball33 room6) (free left)
   goals met: 14 of 40
28. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 14 of 40
29. (pick ball31 room5 left)
   deleted: (at ball31 room5) (free left)
   added: (carry ball31 left)
   goals met: 14 of 40
30. (pick ball30 room5 right)
   deleted: (at ball30 room5) (free right)
   added: (carry ball30 right)
   goals met: 14 of 40
31. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 14 of 40
32. (drop ball30 room6 right)
   deleted: (carry ball30 right)
   added: (at ball30 room6) (free right)
   goals met: 15 of 40
33. (drop ball31 room6 left)
   deleted: (carry ball31 left)
   added: (at ball31 room6) (free left)
   goals met: 16 of 40
34. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 16 of 40
35. (pick ball29 room5 left)
   deleted: (at ball29 room5) (free left)
   added: (carry ball29 left)
   goals met: 16 of 40
36. (pick ball28 room5 right)
   deleted: (at ball28 room5) (free right)
   added: (carry ball28 right)
   goals met: 16 of 40
37. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 16 of 40
38. (drop ball28 room6 right)
   deleted: (carry ball28 right)
   added: (at ball28 room6) (free right)
   goals met: 17 of 40
39. (drop ball29 room6 left)
   deleted: (carry ball29 left)
   added: (at ball29 room6) (free left)
   goals met: 18 of 40
40. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 18 of 40
41. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 18 of 40
42. (pick ball26 room5 right)
   deleted: (at ball26 room5) (free right)
   added: (carry ball26 right)
   goals met: 18 of 40
43. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 18 of 40
44. (drop ball26 room6 right)
   deleted: (carry ball26 right)
   added: (at ball26 room6) (free right)
   goals met: 19 of 40
45. (drop ball27 room6 left)
   deleted: (carry ball27 left)
   added: (at ball27 room6) (free left)
   goals met: 20 of 40
46. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 20 of 40
47. (pick ball25 room4 left)
   deleted: (at ball25 room4) (free left)
   added: (carry ball25 left)
   goals met: 20 of 40
48. (pick ball24 room4 right)
   deleted: (at ball24 room4) (free right)
   added: (carry ball24 right)
   goals met: 20 of 40
49. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 20 of 40
50. (drop ball24 room6 right)
   deleted: (carry ball24 right)
   added: (at ball24 room6) (free right)
   goals met: 21 of 40
51. (drop ball25 room6 left)
   deleted: (carry ball25 left)
   added: (at ball25 room6) (free left)
   goals met: 22 of 40
52. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 22 of 40
53. (pick ball23 room4 left)
   deleted: (at ball23 room4) (free left)
   added: (carry ball23 left)
   goals met: 22 of 40
54. (pick ball22 room4 right)
   deleted: (at ball22 room4) (free right)
   added: (carry ball22 right)
   goals met: 22 of 40
55. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 22 of 40
56. (drop ball22 room6 right)
   deleted: (carry ball22 right)
   added: (at ball22 room6) (free right)
   goals met: 23 of 40
57. (drop ball23 room6 left)
   deleted: (carry ball23 left)
   added: (at ball23 room6) (free left)
   goals met: 24 of 40
58. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 24 of 40
59. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 24 of 40
60. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 24 of 40
61. (drop ball21 room6 left)
   deleted: (carry ball21 left)
   added: (at ball21 room6) (free left)
   goals met: 25 of 40
62. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 25 of 40
63. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 25 of 40
64. (pick ball19 room3 right)
   deleted: (at ball19 room3) (free right)
   added: (carry ball19 right)
   goals met: 25 of 40
65. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 25 of 40
66. (drop ball19 room6 right)
   deleted: (carry ball19 right)
   added: (at ball19 room6) (free right)
   goals met: 26 of 40
67. (drop ball20 room6 left)
   deleted: (carry ball20 left)
   added: (at ball20 room6) (free left)
   goals met: 27 of 40
68. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 27 of 40
69. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 27 of 40
70. (pick ball17 room3 right)
   deleted: (at ball17 room3) (free right)
   added: (carry ball17 right)
   goals met: 27 of 40
71. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 27 of 40
72. (drop ball17 room6 right)
   deleted: (carry ball17 right)
   added: (at ball17 room6) (free right)
   goals met: 28 of 40
73. (drop ball18 room6 left)
   deleted: (carry ball18 left)
   added: (at ball18 room6) (free left)
   goals met: 29 of 40
74. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 29 of 40
75. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 29 of 40
76. (pick ball15 room3 right)
   deleted: (at ball15 room3) (free right)
   added: (carry ball15 right)
   goals met: 29 of 40
77. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 29 of 40
78. (drop ball15 room6 right)
   deleted: (carry ball15 right)
   added: (at ball15 room6) (free right)
   goals met: 30 of 40
79. (drop ball16 room6 left)
   deleted: (carry ball16 left)
   added: (at ball16 room6) (free left)
   goals met: 31 of 40
80. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 31 of 40
81. (pick ball14 room3 left)
   deleted: (at ball14 room3) (free left)
   added: (carry ball14 left)
   goals met: 31 of 40
82. (pick ball13 room3 right)
   deleted: (at ball13 room3) (free right)
   added: (carry ball13 right)
   goals met: 31 of 40
83. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 31 of 40
84. (drop ball13 room6 right)
   deleted: (carry ball13 right)
   added: (at ball13 room6) (free right)
   goals met: 32 of 40
85. (drop ball14 room6 left)
   deleted: (carry ball14 left)
   added: (at ball14 room6) (free left)
   goals met: 33 of 40
86. (move room6 room3)
   deleted: (at-robby room6)
   added: (at-robby room3)
   goals met: 33 of 40
87. (pick ball12 room3 left)
   deleted: (at ball12 room3) (free left)
   added: (carry ball12 left)
   goals met: 33 of 40
88. (move room3 room6)
   deleted: (at-robby room3)
   added: (at-robby room6)
   goals met: 33 of 40
89. (drop ball12 room6 left)
   deleted: (carry ball12 left)
   added: (at ball12 room6) (free left)
   goals met: 34 of 40
90. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 34 of 40
91. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 34 of 40
92. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 34 of 40
93. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 34 of 40
94. (drop ball5 room6 right)
   deleted: (carry ball5 right)
   added: (at ball5 room6) (free right)
   goals met: 35 of 40
95. (drop ball6 room6 left)
   deleted: (carry ball6 left)
   added: (at ball6 room6) (free left)
   goals met: 36 of 40
96. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 36 of 40
97. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 36 of 40
98. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 36 of 40
99. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 36 of 40
100. (drop ball3 room6 right)
   deleted: (carry ball3 right)
   added: (at ball3 room6) (free right)
   goals met: 37 of 40
101. (drop ball4 room6 left)
   deleted: (carry ball4 left)
   added: (at ball4 room6) (free left)
   goals met: 38 of 40
102. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 38 of 40
103. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 38 of 40
104. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 38 of 40
105. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 38 of 40
106. (drop ball2 room6 left)
   deleted: (carry ball2 left)
   added: (at ball2 room6) (free left)
   goals met: 39 of 40
107. (drop ball1 room6 right)
   deleted: (carry ball1 right)
   added: (at ball1 room6) (free right)
   goals met: 40 of 40
